# groupby

In [1]:
import numpy as np
import pandas as pd

In [12]:
dic={ 'names':'PRABHAS RANVEER SHARUK PRABHAS RANVEER SHARUK '.split(),'ratings':[8.5,8.0,7.5,8.5,8.0 ,7.5]}
fra=pd.DataFrame(dic)
fra.index.names=['s.no']
fra

        names  ratings
s.no
0     PRABHAS      8.5
1     RANVEER      8.0
2      SHARUK      7.5
3     PRABHAS      8.5
4     RANVEER      8.0
5      SHARUK      7.5

In [20]:
fra.iloc[2]

names      SHARUK
ratings       7.5
Name: 2, dtype: object

In [13]:
grp=fra.groupby('names')
grp.mean()

         ratings
names
PRABHAS      8.5
RANVEER      8.0
SHARUK       7.5

In [14]:
grp.sum()

         ratings
names
PRABHAS     17.0
RANVEER     16.0
SHARUK      15.0

In [16]:
grp.std()

         ratings
names
PRABHAS      0.0
RANVEER      0.0
SHARUK       0.0

In [24]:
grp.count()

         ratings
names
PRABHAS        2
RANVEER        2
SHARUK         2

In [25]:
grp.count().loc['PRABHAS']

ratings    2
Name: PRABHAS, dtype: int64

In [28]:
grp.min()  # if there are many data you will get different data

         ratings
names
PRABHAS      8.5
RANVEER      8.0
SHARUK       7.5

In [29]:
grp.describe()

        ratings
          count mean  std  min  25%  50%  75%  max
names
PRABHAS     2.0  8.5  0.0  8.5  8.5  8.5  8.5  8.5
RANVEER     2.0  8.0  0.0  8.0  8.0  8.0  8.0  8.0
SHARUK      2.0  7.5  0.0  7.5  7.5  7.5  7.5  7.5

In [30]:
grp.describe().transpose()

names          PRABHAS  RANVEER  SHARUK
ratings count      2.0      2.0     2.0
        mean       8.5      8.0     7.5
        std        0.0      0.0     0.0
        min        8.5      8.0     7.5
        25%        8.5      8.0     7.5
        50%        8.5      8.0     7.5
        75%        8.5      8.0     7.5
        max        8.5      8.0     7.5

# OPERATIONS

In [3]:
df=pd.DataFrame({'NAMES':'shradha alia dhisa'.split(),'AGE':'28 28 26'.split(),'MOVIES':'14 15 14'.split()})
df.head()

     NAMES AGE MOVIES
0  shradha  28     14
1     alia  28     15
2    dhisa  26     14

In [9]:
df['AGE'].unique()  # it is used to find unique values from the data

array(['28', '26'], dtype=object)

In [10]:
df['AGE'].nunique()  #  it is used to find the length of unique values from the data

2

In [13]:
df['AGE'].value_counts()  # it ill counts values

28    2
26    1
Name: AGE, dtype: int64

In [5]:
df['AGE'].sort_values()  # sorting of the perticular data i.e perticular columns

2    26
0    28
1    28
Name: AGE, dtype: object

In [14]:
df['MOVIES'].apply(lambda x:x+x)  # it will apply any function to every  element of the data

0    1414
1    1515
2    1414
Name: MOVIES, dtype: object

In [16]:
df.columns

Index(['NAMES', 'AGE', 'MOVIES'], dtype='object')

In [17]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
NAMES     3 non-null object
AGE       3 non-null object
MOVIES    3 non-null object
dtypes: object(3)
memory usage: 152.0+ bytes

# string handling

In [39]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj','Raju','Rani'], 
        'Age':[27, 25, 22, 32,25,25], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannauj','Gurugarm','Nagaland'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd','BYPC','MPC']}
dset=pd.DataFrame(data)
dset

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1  Princi   25     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd
4    Raju   25   Gurugarm          BYPC
5    Rani   25   Nagaland           MPC

In [31]:
dset['Name']=dset['Name'].str.lower()         #str.lower() this function converts all uppercase characters to lowercase.
dset['Address']=dset['Address'].str.upper()    # str.upper() this function converts all lowercase characters to uppercase.
dset

     Name  Age    Address Qualification
0     jai   27     NAGPUR           Msc
1  princi   25     KANPUR            MA
2  gaurav   22  ALLAHABAD           MCA
3    anuj   32    KANNAUJ           Phd
4    raju   25   GURUGARM          BYPC
5    rani   25   NAGALAND           MPC

In [34]:
dset['Address']=dset['Address'].str.split('a',n=1)
dset

     Name  Age       Address Qualification
0     Jai   27     [N, gpur]           Msc
1  Princi   25     [K, npur]            MA
2  Gaurav   22  [All, habad]           MCA
3    Anuj   32    [K, nnauj]           Phd
4    Raju   25   [Gurug, rm]          BYPC
5    Rani   25   [N, galand]           MPC

In [56]:
dset['Age']=dset['Age'].replace(25,"Twenty Five")     #REPLACE()
#filter=(dset['Age']=="Twenty five")                #this line is in doubt
dset  #['Age']

     Name          Age    Address Qualification
0     Jai           27     Nagpur           Msc
1  Princi  Twenty Five     Kanpur            MA
2  Gaurav           22  Allahabad           MCA
3    Anuj           32    Kannauj           Phd
4    Raju  Twenty Five   Gurugarm          BYPC
5    Rani  Twenty Five   Nagaland           MPC

In [58]:
new=dset['Address'].copy()       # CONCATINATION :-cat() 
dset['Name']=dset['Name'].str.cat(new,sep=',')
dset

               Name          Age    Address Qualification
0        Jai,Nagpur           27     Nagpur           Msc
1     Princi,Kanpur  Twenty Five     Kanpur            MA
2  Gaurav,Allahabad           22  Allahabad           MCA
3      Anuj,Kannauj           32    Kannauj           Phd
4     Raju,Gurugarm  Twenty Five   Gurugarm          BYPC
5     Rani,Nagaland  Twenty Five   Nagaland           MPC

In [112]:
data_2 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],   #REMOVING WHITE SPACES
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur junction', 'Kanpur junction', 
                   'Nagpur junction', 'Kannuaj junction'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
dset_2=pd.DataFrame(data_2)


new=dset_2['Address'].replace("kanpur junction","   kanpur junction    ").copy()

In [113]:
new

0     Nagpur junction
1     Kanpur junction
2     Nagpur junction
3    Kannuaj junction
Name: Address, dtype: object

In [88]:

print(new.str.rstrip=="Nagpur junction")
print(new.str.strip=="Nagpur junction")
print(new.str.strip==" Nagpur junction")

False
False
False

In [104]:
new=new.str.lstrip()
new

0     Nagpur junction
1     Kanpur junction
2     Nagpur junction
3    Kannuaj junction
Name: Address, dtype: object